//描述
//
//杨辉三角，又叫做帕斯卡三角，在概率论和统计学中有着广泛的运用。
//
//它的一个重要性质是：三角形中的每个数字等于它两肩上的数字相加。
//
//下面给出了杨辉三角形的前5行
//
//1
//
//1 1
//
//1 2 1
//
//1 3 3 1
//
//1 4 6 4 1
//
//
//输入
//
//从左往右输入两个整数i和k。（i<=16，k<=16），i表示行数，k表示从左往右数第k个数。
//
//
//输出
//
//一个正整数，当整数i和k的输入有误则输出：error


#include <stdio.h>

int main()
{
	int i, k;
	long long arr[16][16] = { 0 };
	scanf("%d %d", &i, &k);

	if (i > 16 || k > i || i < 1 || k < 1)
	{
		printf("error");
		return 0;
	}

	for (int t = 0; t < 16; t++)
	{
		for (int j = 0; j <= t; j++)
		{
			if (j == 0 || j == t)
				arr[t][j] = 1;

			if (t >= 2 && j >= 1)
				arr[t][j] = arr[t - 1][j] + arr[t - 1][j - 1];
		}
	}

	printf("%lld", arr[i - 1][k - 1]);

	return 0;
}
