// 1.旋转中心
// 确定你希望围绕哪个点O进行旋转。两条反射轴L1和L2必须在O点相交。
// 2.确定翻转轴线
// 你需要找到两条反射轴L1 和 L2，使它们之间的夹角为θ/2。
// 再围绕这两条轴线进行翻转，两次翻转以后就是所求图像（仅限方阵）

// 对于本题而言就是找到主对角线，再找到中轴线，此时夹角45°，然后分别进行两次翻转。

class Solution {
public:
    void rotate(vector<vector<int>>& matrix) {
        for(int i = 0; i < matrix.size(); ++i)
            for(int j = i + 1; j < matrix.size(); ++j)
                swap(matrix[i][j], matrix[j][i]);

        for(auto& row : matrix) reverse(row.begin(), row.end());
    }
};


// 示例 1：
// 输入：matrix = [[1,2,3],[4,5,6],[7,8,9]]
// 输出：[[7,4,1],[8,5,2],[9,6,3]]


// 示例 2：
// 输入：matrix = [[5,1,9,11],[2,4,8,10],[13,3,6,7],[15,14,12,16]]
// 输出：[[15,13,2,5],[14,3,4,1],[12,6,8,9],[16,7,10,11]]